/*
Создать класс ноутбук. На основе других объектов таких как:
Процессор  //
ОЗУ        //...
Мышка
Веб-камера окрема//
Принтер    //...
Видеокарта //...

Пишемо окремо класи :Процессор, ОЗУ, Мышка, Веб-камера, Принтер, Видеокарта.
Створити class Nout котрий отримає
 чи агрегацію чи композицію Процессора, ОЗУ, Мышки, Веб-камери, Принтера, Видеокарти
В класі Nout конструктори та метод void Print() const;



Пример класса Мышка:

class Mouse{

MyString name;
 public:
Mouse(const char* name){this->name=name;}

////сеттери геттери якщо потрібно, додати метод void Print() const;
}


MyString замість   string   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


*/

#include <iostream>
using namespace std;

int main()
{







}

