/*
Создать класс ноутбук. На основе других объектов таких как:
Процессор  //
ОЗУ        //...
Мышка
Веб-камера окрема//
Принтер    //...
Видеокарта //...

Пишемо окремо класи :Процессор, ОЗУ, Мышка, Веб-камера, Принтер, Видеокарта.
Створити class Nout котрий отримає
 чи агрегацію чи композицію Процессора, ОЗУ, Мышки, Веб-камери, Принтера, Видеокарти
В класі Nout конструктори та метод void Print() const;



Пример класса Мышка:

class Mouse{

MyString name;
 public:
Mouse(const char* name){this->name=name;}

////сеттери геттери якщо потрібно, додати метод void Print() const;
}


MyString замість   string   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


*/

#include <iostream>
using namespace std;

int main()
{
	cout << "Hello World!" << endl;
	// Создание объектов классов
	// Пример:
	// Processor processor("Intel Core i7", 8, 16, 3.5);
	// RAM ram("Corsair Vengeance", 16, 3200);
	// Mouse mouse("Logitech G502", "Wireless", 16000);
	// Webcam webcam("Logitech C920");
	// Printer printer("HP LaserJet");
	// GraphicsCard graphicsCard("NVIDIA GeForce RTX 3080");
	// Создание объекта класса Nout с использованием агрегации или композиции
	// Nout nout(processor, ram, mouse, webcam, printer, graphicsCard);
	return 0;







}

